n2 = ["A", "B", "V", "G", "D", "E", "E", "Zh", "Z", "I", "I", "K", "L", "M", "N", "O", "P", "R", "S", "T", "U", "F",
      "Kh", "Tc", "Ch", "Shh", "Shch", "Y", "E", "Iu", "Ia", "a", "b", "v", "g", "d", "e", "e", "zh", "z", "i", "i",
      "k", "l", "m", "n", "o", "p", "r", "s", "t", "u", "f", "kh", "tc", "ch", "shh", "shch", "y", "e", "iu", "ia"]
n1 = ["А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х",
      "Ц", "Ч", "Ш", "Щ", "Ы", "Э", "Ю", "Я", "а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н",
      "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ы", "э", "ю", "я"]
n3 = ["ь", "ъ"]

a = input()
res = ""
for i in range(a.__len__()):
    if n1.__contains__(a[i]):
        res += n2[n1.index(a[i])]
    elif not n3.__contains__(a[i]):
        res += a[i]

print(res)

